; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image2 - mode
	spectrograph1 - mode
	infrared0 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(supports instrument2 image2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(supports instrument3 image2)
	(calibration_target instrument3 Star3)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
)
(:goal (and
	(have_image Phenomenon5 infrared0)
	(have_image Phenomenon6 image2)
	(have_image Planet7 image2)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph1)
	(have_image Phenomenon11 image2)
	(have_image Phenomenon12 image2)
	(have_image Star13 image2)
	(have_image Planet14 spectrograph1)
	(have_image Star15 infrared0)
	(have_image Star16 infrared0)
))

)

; plan
1. (turn_to satellite0 star0 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star0)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 12
5. (take_image satellite0 phenomenon6 instrument1 image2)
   added: (have_image phenomenon6 image2)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon5 instrument1 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon12 instrument1 image2)
   added: (have_image phenomenon12 image2)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon11 instrument1 image2)
   added: (have_image phenomenon11 image2)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 5 of 12
14. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 5 of 12
15. (take_image satellite0 planet10 instrument1 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 6 of 12
16. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 6 of 12
17. (take_image satellite0 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 7 of 12
18. (turn_to satellite0 planet7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet7)
   goals met: 7 of 12
19. (take_image satellite0 planet7 instrument1 image2)
   added: (have_image planet7 image2)
   goals met: 8 of 12
20. (turn_to satellite0 star13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star13)
   goals met: 8 of 12
21. (take_image satellite0 star13 instrument1 image2)
   added: (have_image star13 image2)
   goals met: 9 of 12
22. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 9 of 12
23. (take_image satellite0 star15 instrument1 infrared0)
   added: (have_image star15 infrared0)
   goals met: 10 of 12
24. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 10 of 12
25. (take_image satellite0 star16 instrument1 infrared0)
   added: (have_image star16 infrared0)
   goals met: 11 of 12
26. (turn_to satellite0 star8 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star8)
   goals met: 11 of 12
27. (take_image satellite0 star8 instrument1 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 12 of 12
